---------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/shuhuisun/Downloads/bike-sharing-demand/final project4.log
  log type:  text
 opened on:   9 Dec 2022, 09:50:13

. 
. clear all

. set more off

. 
. use "/Users/shuhuisun/Downloads/Bike-Sharing-Dataset/hour.dta"

. 
. *summary statistics
. sum season holiday workingday weathersit temp atemp hum windspeed casual registered cnt

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      season |     17,379     2.50164    1.106918          1          4
     holiday |     17,379    .0287704    .1671653          0          1
  workingday |     17,379    .6827205    .4654306          0          1
  weathersit |     17,379    1.425283    .6393569          1          4
        temp |     17,379    .4969872    .1925561        .02          1
-------------+---------------------------------------------------------
       atemp |     17,379    .4757751    .1718502          0          1
         hum |     17,379    .6272288    .1929298          0          1
   windspeed |     17,379    .1900976    .1223402          0      .8507
      casual |     17,379    35.67622    49.30503          0        367
  registered |     17,379    153.7869    151.3573          0        886
-------------+---------------------------------------------------------
         cnt |     17,379    189.4631    181.3876          1        977

. outreg2 using Table_summary, excel replace sum(log)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     instant |     17,379        8690    5017.029          1      17379
      season |     17,379     2.50164    1.106918          1          4
          yr |     17,379    .5025606    .5000078          0          1
        mnth |     17,379    6.537775    3.438776          1         12
          hr |     17,379    11.54675    6.914405          0         23
-------------+---------------------------------------------------------
     holiday |     17,379    .0287704    .1671653          0          1
     weekday |     17,379    3.003683    2.005771          0          6
  workingday |     17,379    .6827205    .4654306          0          1
  weathersit |     17,379    1.425283    .6393569          1          4
        temp |     17,379    .4969872    .1925561        .02          1
-------------+---------------------------------------------------------
       atemp |     17,379    .4757751    .1718502          0          1
         hum |     17,379    .6272288    .1929298          0          1
   windspeed |     17,379    .1900976    .1223402          0      .8507
      casual |     17,379    35.67622    49.30503          0        367
  registered |     17,379    153.7869    151.3573          0        886
-------------+---------------------------------------------------------
         cnt |     17,379    189.4631    181.3876          1        977

Following variable is string, not included:  
dteday  
Table_summary.xml
dir : seeout

. 
. pwcorr cnt temp atemp hum windspeed workingday holiday

             |      cnt     temp    atemp      hum windsp~d workin~y  holiday
-------------+---------------------------------------------------------------
         cnt |   1.0000 
        temp |   0.4048   1.0000 
       atemp |   0.4009   0.9877   1.0000 
         hum |  -0.3229  -0.0699  -0.0519   1.0000 
   windspeed |   0.0932  -0.0231  -0.0623  -0.2901   1.0000 
  workingday |   0.0303   0.0554   0.0547   0.0157  -0.0118   1.0000 
     holiday |  -0.0309  -0.0273  -0.0310  -0.0106   0.0040  -0.2525   1.0000 

. 
. 
. *OLS
. reg cnt i.season i.holiday i.workingday i.weather temp hum windspeed

      Source |       SS           df       MS      Number of obs   =    17,379
-------------+----------------------------------   F(11, 17367)    =    624.38
       Model |   162035130        11  14730466.4   Prob > F        =    0.0000
    Residual |   409726461    17,367  23592.2417   R-squared       =    0.2834
-------------+----------------------------------   Adj R-squared   =    0.2829
       Total |   571761591    17,378  32901.4611   Root MSE        =     153.6

------------------------------------------------------------------------------
         cnt |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      season |
          2  |  -.9866085   4.159573    -0.24   0.813     -9.13979    7.166573
          3  |  -43.40399   5.316568    -8.16   0.000      -53.825   -32.98298
          4  |    57.0896   3.653925    15.62   0.000     49.92754    64.25166
             |
   1.holiday |   -27.6103   7.211507    -3.83   0.000    -41.74558   -13.47502
1.workingday |   1.726592   2.594678     0.67   0.506    -3.359238    6.812423
             |
  weathersit |
          2  |   17.02304    2.84236     5.99   0.000     11.45173    22.59435
          3  |  -3.437499   4.743188    -0.72   0.469    -12.73462    5.859626
          4  |   104.8196   88.75536     1.18   0.238    -69.14979    278.7891
             |
        temp |   454.7938    9.96304    45.65   0.000     435.2652    474.3223
         hum |  -286.6522   7.221012   -39.70   0.000    -300.8061   -272.4983
   windspeed |   31.65289    10.2025     3.10   0.002     11.65498    51.65081
       _cons |     130.22    6.77529    19.22   0.000     116.9398    143.5003
------------------------------------------------------------------------------

. outreg2 using OLS, excel dec(3) replace
OLS.xml
dir : seeout

. 
. 
. **test of heteroskedasticity
. *1plot
. rvfplot, yline(0)

. graph save "/Users/shuhuisun/Downloads/Bike-Sharing-Dataset",replace
(file /Users/shuhuisun/Downloads/Bike-Sharing-Dataset.gph saved)

. graph export "/Users/shuhuisun/Downloads/Bike-Sharing-Dataset/visual_heteroskedasticity.tif
> ", as(tif) replace
(file /Users/shuhuisun/Downloads/Bike-Sharing-Dataset/visual_heteroskedasticity.tif written i
> n TIFF format)

. 
. *2Breush-Pagon test
. reg cnt i.season i.holiday i.workingday i.weather temp hum windspeed 

      Source |       SS           df       MS      Number of obs   =    17,379
-------------+----------------------------------   F(11, 17367)    =    624.38
       Model |   162035130        11  14730466.4   Prob > F        =    0.0000
    Residual |   409726461    17,367  23592.2417   R-squared       =    0.2834
-------------+----------------------------------   Adj R-squared   =    0.2829
       Total |   571761591    17,378  32901.4611   Root MSE        =     153.6

------------------------------------------------------------------------------
         cnt |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      season |
          2  |  -.9866085   4.159573    -0.24   0.813     -9.13979    7.166573
          3  |  -43.40399   5.316568    -8.16   0.000      -53.825   -32.98298
          4  |    57.0896   3.653925    15.62   0.000     49.92754    64.25166
             |
   1.holiday |   -27.6103   7.211507    -3.83   0.000    -41.74558   -13.47502
1.workingday |   1.726592   2.594678     0.67   0.506    -3.359238    6.812423
             |
  weathersit |
          2  |   17.02304    2.84236     5.99   0.000     11.45173    22.59435
          3  |  -3.437499   4.743188    -0.72   0.469    -12.73462    5.859626
          4  |   104.8196   88.75536     1.18   0.238    -69.14979    278.7891
             |
        temp |   454.7938    9.96304    45.65   0.000     435.2652    474.3223
         hum |  -286.6522   7.221012   -39.70   0.000    -300.8061   -272.4983
   windspeed |   31.65289    10.2025     3.10   0.002     11.65498    51.65081
       _cons |     130.22    6.77529    19.22   0.000     116.9398    143.5003
------------------------------------------------------------------------------

. estat hettest

Breusch-Pagan / Cook-Weisberg test for heteroskedasticity 
         Ho: Constant variance
         Variables: fitted values of cnt

         chi2(1)      =  1277.32
         Prob > chi2  =   0.0000

. *3Aternative White's test
. imtest, white

White's test for Ho: homoskedasticity
         against Ha: unrestricted heteroskedasticity

         chi2(56)     =   1107.84
         Prob > chi2  =    0.0000

Cameron & Trivedi's decomposition of IM-test

---------------------------------------------------
              Source |       chi2     df      p
---------------------+-----------------------------
  Heteroskedasticity |    1107.84     56    0.0000
            Skewness |    1324.52     11    0.0000
            Kurtosis |     339.96      1    0.0000
---------------------+-----------------------------
               Total |    2772.32     68    0.0000
---------------------------------------------------

. *there exists heteroskedasticity
. 
. 
. *ols+hr
. reg cnt i.season i.holiday i.workingday i.weather temp hum windspeed i.hr, robust

Linear regression                               Number of obs     =     17,379
                                                F(34, 17344)      =     948.69
                                                Prob > F          =     0.0000
                                                R-squared         =     0.6267
                                                Root MSE          =     110.93

------------------------------------------------------------------------------
             |               Robust
         cnt |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      season |
          2  |   35.50174    2.90905    12.20   0.000     29.79971    41.20377
          3  |   15.35611   4.050776     3.79   0.000     7.416184    23.29604
          4  |   62.55172   2.483313    25.19   0.000     57.68417    67.41926
             |
   1.holiday |  -25.29079   5.402415    -4.68   0.000    -35.88006   -14.70151
1.workingday |   4.209973    2.09176     2.01   0.044     .1099129    8.310033
             |
  weathersit |
          2  |   -6.13025   1.946409    -3.15   0.002    -9.945408   -2.315093
          3  |  -61.52853   3.393188   -18.13   0.000    -68.17952   -54.87754
          4  |  -38.73683   64.77082    -0.60   0.550    -165.6942     88.2205
             |
        temp |   276.2248     7.8618    35.14   0.000     260.8148    291.6347
         hum |  -101.1137   5.796401   -17.44   0.000    -112.4752   -89.75218
   windspeed |  -45.10361   7.498968    -6.01   0.000    -59.80235   -30.40488
             |
          hr |
          1  |  -16.88112   2.949317    -5.72   0.000    -22.66207   -11.10016
          2  |  -25.01511   2.945038    -8.49   0.000    -30.78768   -19.24254
          3  |  -35.07049   2.862713   -12.25   0.000    -40.68169   -29.45928
          4  |  -37.05709   2.856555   -12.97   0.000    -42.65622   -31.45795
          5  |  -20.88177   2.770013    -7.54   0.000    -26.31127   -15.45226
          6  |   37.56875   2.936548    12.79   0.000     31.81282    43.32468
          7  |   171.9858   5.721434    30.06   0.000     160.7712    183.2004
          8  |   311.3672   8.318671    37.43   0.000     295.0618    327.6726
          9  |   161.9687    3.57856    45.26   0.000     154.9544    168.9831
         10  |   105.4094   3.933499    26.80   0.000     97.69938    113.1195
         11  |   129.0404   4.661303    27.68   0.000     119.9037     138.177
         12  |   166.8931    5.15726    32.36   0.000     156.7843    177.0018
         13  |    160.968   5.304869    30.34   0.000       150.57    171.3661
         14  |   144.5459   5.336273    27.09   0.000     134.0863    155.0055
         15  |   153.7696   5.232189    29.39   0.000      143.514    164.0252
         16  |   216.0955   4.833419    44.71   0.000     206.6215    225.5695
         17  |     370.55   7.418345    49.95   0.000     356.0093    385.0907
         18  |   339.7161   7.237455    46.94   0.000       325.53    353.9022
         19  |   232.5748   4.979379    46.71   0.000     222.8148    242.3349
         20  |   154.2383   3.712068    41.55   0.000     146.9623    161.5143
         21  |   105.8105   3.007779    35.18   0.000      99.9149     111.706
         22  |   69.59863   2.704518    25.73   0.000      64.2975    74.89975
         23  |   31.35992    2.64599    11.85   0.000     26.17351    36.54632
             |
       _cons |  -22.42369   5.237418    -4.28   0.000    -32.68955   -12.15782
------------------------------------------------------------------------------

. outreg2 using ols_hr, excel dec(3) replace
ols_hr.xml
dir : seeout

. *graph hr coefficient would show that at 8/17/18o'clock, the demand is high (rush hours)
. 
. *ols+hr+t
. reg cnt i.season i.holiday i.workingday i.weather temp hum windspeed i.hr instant, robust

Linear regression                               Number of obs     =     17,379
                                                F(35, 17343)      =     966.58
                                                Prob > F          =     0.0000
                                                R-squared         =     0.6753
                                                Root MSE          =     103.46

------------------------------------------------------------------------------
             |               Robust
         cnt |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      season |
          2  |   33.43041   2.664737    12.55   0.000     28.20726    38.65357
          3  |  -1.546272   3.679463    -0.42   0.674     -8.75839    5.665846
          4  |   18.03787   2.455606     7.35   0.000     13.22463     22.8511
             |
   1.holiday |   -28.6829   5.426258    -5.29   0.000    -39.31891   -18.04689
1.workingday |   5.015106   1.994098     2.51   0.012     1.106473     8.92374
             |
  weathersit |
          2  |  -9.999815   1.827541    -5.47   0.000    -13.58198    -6.41765
          3  |  -64.42708   3.295692   -19.55   0.000    -70.88697   -57.96719
          4  |  -50.25155   58.50214    -0.86   0.390    -164.9216    64.41853
             |
        temp |   245.6069   7.169285    34.26   0.000     231.5544    259.6594
         hum |  -80.81379   5.373048   -15.04   0.000    -91.34551   -70.28207
   windspeed |  -35.14404   6.982695    -5.03   0.000    -48.83083   -21.45726
             |
          hr |
          1  |  -17.36533   3.428945    -5.06   0.000    -24.08641   -10.64425
          2  |  -26.35547   3.475139    -7.58   0.000     -33.1671   -19.54385
          3  |  -36.99578   3.435864   -10.77   0.000    -43.73042   -30.26114
          4  |   -39.9217    3.41246   -11.70   0.000    -46.61046   -33.23293
          5  |  -23.25004   3.288332    -7.07   0.000     -29.6955   -16.80458
          6  |   35.63317   3.212461    11.09   0.000     29.33642    41.92991
          7  |   170.6071   5.527125    30.87   0.000     159.7734    181.4409
          8  |   310.9456   7.942992    39.15   0.000     295.3766    326.5147
          9  |   162.9534   3.259546    49.99   0.000     156.5643    169.3424
         10  |   107.8559   3.824272    28.20   0.000       100.36    115.3519
         11  |   132.9981   4.464398    29.79   0.000     124.2475    141.7488
         12  |   172.0932   4.869095    35.34   0.000     162.5492    181.6371
         13  |   166.9009   5.032782    33.16   0.000     157.0361    176.7656
         14  |   150.9129   5.111476    29.52   0.000     140.8939    160.9319
         15  |    160.243   4.957215    32.33   0.000     150.5264    169.9597
         16  |   222.3051   4.389717    50.64   0.000     213.7008    230.9094
         17  |   376.1101   6.967079    53.98   0.000     362.4539    389.7663
         18  |   344.4211   6.819286    50.51   0.000     331.0546    357.7876
         19  |   236.1101   4.649447    50.78   0.000     226.9967    245.2235
         20  |   156.7768   3.542508    44.26   0.000     149.8332    163.7205
         21  |   107.5175   3.029544    35.49   0.000     101.5793    113.4557
         22  |   70.61366   2.904792    24.31   0.000     64.91997    76.30734
         23  |   31.83979   2.985458    10.66   0.000     25.98799    37.69159
             |
     instant |   .0087943   .0001792    49.07   0.000      .008443    .0091456
       _cons |  -83.59271   5.252773   -15.91   0.000    -93.88868   -73.29675
------------------------------------------------------------------------------

. outreg2 using ols_hr, excel dec(3)
ols_hr.xml
dir : seeout

. *season coefs become more reasonable when separating time trend from season
. 
. *Get R^2 without time trend
. reg cnt instant, robust

Linear regression                               Number of obs     =     17,379
                                                F(1, 17377)       =    1474.59
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0775
                                                Root MSE          =     174.22

------------------------------------------------------------------------------
             |               Robust
         cnt |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     instant |   .0100646   .0002621    38.40   0.000     .0095509    .0105783
       _cons |   102.0016    2.03176    50.20   0.000     98.01918    105.9841
------------------------------------------------------------------------------

. predict cnthat, r

. reg cnthat i.season i.holiday i.workingday i.weather temp hum windspeed i.hr, robust 

Linear regression                               Number of obs     =     17,379
                                                F(34, 17344)      =     973.80
                                                Prob > F          =     0.0000
                                                R-squared         =     0.6470
                                                Root MSE          =     103.61

------------------------------------------------------------------------------
             |               Robust
      cnthat |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      season |
          2  |   33.13122   2.664434    12.43   0.000     27.90866    38.35378
          3  |  -3.987725   3.671846    -1.09   0.277    -11.18491    3.209462
          4  |   11.60809   2.349933     4.94   0.000     7.001988     16.2142
             |
   1.holiday |  -29.17287   5.486259    -5.32   0.000    -39.92649   -18.41925
1.workingday |   5.131403   1.999961     2.57   0.010     1.211278    9.051529
             |
  weathersit |
          2  |  -10.55875    1.82905    -5.77   0.000    -14.14387    -6.97363
          3  |  -64.84576   3.318166   -19.54   0.000     -71.3497   -58.34182
          4  |  -51.91479    58.0264    -0.89   0.371    -165.6524    61.82281
             |
        temp |   241.1843    7.12039    33.87   0.000     227.2276     255.141
         hum |  -77.88158   5.336153   -14.60   0.000    -88.34098   -67.42219
   windspeed |  -33.70544   6.988041    -4.82   0.000     -47.4027   -20.00817
             |
          hr |
          1  |  -17.43527   3.595264    -4.85   0.000    -24.48235    -10.3882
          2  |  -26.54908   3.646269    -7.28   0.000    -33.69613   -19.40203
          3  |  -37.27388    3.61333   -10.32   0.000    -44.35637   -30.19139
          4  |  -40.33547   3.587774   -11.24   0.000    -47.36787   -33.30308
          5  |  -23.59212   3.462615    -6.81   0.000     -30.3792   -16.80505
          6  |   35.35358   3.361314    10.52   0.000     28.76507     41.9421
          7  |    170.408   5.568203    30.60   0.000     159.4938    181.3222
          8  |   310.8847   7.934959    39.18   0.000     295.3314    326.4381
          9  |   163.0956   3.322016    49.10   0.000     156.5841    169.6071
         10  |   108.2093   3.901531    27.74   0.000     100.5619    115.8567
         11  |   133.5698   4.511828    29.60   0.000     124.7262    142.4134
         12  |   172.8443   4.893488    35.32   0.000     163.2526     182.436
         13  |   167.7578   5.055958    33.18   0.000     157.8477     177.668
         14  |   151.8326   5.141286    29.53   0.000     141.7552      161.91
         15  |   161.1781   4.982682    32.35   0.000     151.4115    170.9446
         16  |    223.202   4.399742    50.73   0.000     214.5781    231.8259
         17  |   376.9132   6.936245    54.34   0.000     363.3175     390.509
         18  |   345.1007   6.795376    50.78   0.000     331.7811    358.4204
         19  |   236.6208   4.670434    50.66   0.000     227.4663    245.7753
         20  |   157.1435   3.615886    43.46   0.000      150.056     164.231
         21  |   107.7641   3.148647    34.23   0.000     101.5924    113.9357
         22  |   70.76027   3.053328    23.17   0.000     64.77544     76.7451
         23  |    31.9091   3.148334    10.14   0.000     25.73805    38.08015
             |
       _cons |  -194.4299   5.115644   -38.01   0.000     -204.457   -184.4027
------------------------------------------------------------------------------

. outreg2 using ols_hr, excel dec(3) 
ols_hr.xml
dir : seeout

. *R-squared is 0.6473, not bad.
. 
. *simplify the model by rush and non-rush hours
. gen rush = 1 if hr == 8 | hr == 17 | hr == 18 
(15,194 missing values generated)

. replace rush = 0 if rush ==.
(15,194 real changes made)

. *coef >= 300 as threshold
. reg cnt i.season i.holiday i.workingday i.weather temp hum windspeed i.rush, robust

Linear regression                               Number of obs     =     17,379
                                                F(12, 17366)      =    1028.26
                                                Prob > F          =     0.0000
                                                R-squared         =     0.4679
                                                Root MSE          =     132.36

------------------------------------------------------------------------------
             |               Robust
         cnt |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      season |
          2  |    5.65475    3.34307     1.69   0.091    -.8980044     12.2075
          3  |   -33.0058    4.70449    -7.02   0.000    -42.22707   -23.78452
          4  |   57.60806   2.888802    19.94   0.000     51.94572    63.27041
             |
   1.holiday |  -27.28844   5.946811    -4.59   0.000    -38.94479   -15.63209
1.workingday |   2.146411   2.386104     0.90   0.368    -2.530593    6.823415
             |
  weathersit |
          2  |    14.2258   2.369183     6.00   0.000      9.58196    18.86963
          3  |  -16.37264    3.81234    -4.29   0.000    -23.84521   -8.900066
          4  |   39.75719    32.6507     1.22   0.223    -24.24147    103.7558
             |
        temp |   421.9553   8.620938    48.95   0.000     405.0574    438.8532
         hum |  -252.2484     6.3522   -39.71   0.000    -264.6993   -239.7974
   windspeed |   7.057296   8.570085     0.82   0.410    -9.740932    23.85552
      1.rush |   236.6076   4.357515    54.30   0.000     228.0664    245.1488
       _cons |   96.89071    5.59151    17.33   0.000     85.93079    107.8506
------------------------------------------------------------------------------

. outreg2 using OLS, excel dec(3)
OLS.xml
dir : seeout

. *graph hr coefficient would show that at 8/17/18o'clock, the demand is high (rush hours)
. 
. *ols+rush+t
. reg cnt i.season i.holiday i.workingday i.weather temp hum windspeed i.rush instant, robust

Linear regression                               Number of obs     =     17,379
                                                F(13, 17365)      =    1115.29
                                                Prob > F          =     0.0000
                                                R-squared         =     0.5092
                                                Root MSE          =     127.12

------------------------------------------------------------------------------
             |               Robust
         cnt |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      season |
          2  |   2.335906   3.199611     0.73   0.465    -3.935653    8.607465
          3  |  -50.89631   4.448316   -11.44   0.000    -59.61546   -42.17716
          4  |   16.37747   2.892302     5.66   0.000     10.70826    22.04667
             |
   1.holiday |  -30.51725   5.912975    -5.16   0.000    -42.10727   -18.92722
1.workingday |   2.784523   2.321759     1.20   0.230    -1.766359    7.335405
             |
  weathersit |
          2  |   11.50335   2.291941     5.02   0.000     7.010917    15.99579
          3  |  -17.04196   3.694997    -4.61   0.000    -24.28452   -9.799394
          4  |   33.70148   43.50025     0.77   0.439     -51.5634    118.9664
             |
        temp |   400.7179   8.216365    48.77   0.000      384.613    416.8228
         hum |  -240.4855   5.986347   -40.17   0.000    -252.2194   -228.7517
   windspeed |   17.99667   8.216016     2.19   0.029     1.892449    34.10089
      1.rush |   237.5331   4.066482    58.41   0.000     229.5624    245.5038
     instant |   .0080954   .0002111    38.34   0.000     .0076816    .0085093
       _cons |   43.45749   5.466924     7.95   0.000     32.74177    54.17321
------------------------------------------------------------------------------

. outreg2 using OLS, excel dec(3) 
OLS.xml
dir : seeout

. *season coefs become more reasonable when separating time trend from season
. 
. *Get R^2 without time trend
. reg cnthat i.season i.holiday i.workingday i.weather temp hum windspeed i.rush, robust 

Linear regression                               Number of obs     =     17,379
                                                F(12, 17366)      =    1046.37
                                                Prob > F          =     0.0000
                                                R-squared         =     0.4654
                                                Root MSE          =     127.43

------------------------------------------------------------------------------
             |               Robust
      cnthat |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      season |
          2  |   1.528609   3.216373     0.48   0.635    -4.775805    7.833024
          3  |  -55.24811   4.458979   -12.39   0.000    -63.98816   -46.50806
          4  |   6.348272    2.80156     2.27   0.023      .856933    11.83961
             |
   1.holiday |  -31.30264   5.984016    -5.23   0.000    -43.03192   -19.57337
1.workingday |   2.939741   2.331614     1.26   0.207    -1.630457    7.509939
             |
  weathersit |
          2  |   10.84113    2.30044     4.71   0.000     6.332034    15.35022
          3  |  -17.20477   3.717811    -4.63   0.000    -24.49205   -9.917487
          4  |   32.22845   46.81948     0.69   0.491    -59.54244    123.9993
             |
        temp |    395.552   8.169063    48.42   0.000     379.5398    411.5642
         hum |  -237.6243   5.946478   -39.96   0.000      -249.28   -225.9686
   windspeed |   20.65763   8.232916     2.51   0.012     4.520287    36.79497
      1.rush |   237.7582   4.015194    59.21   0.000     229.8881    245.6284
       _cons |  -71.54158   5.327494   -13.43   0.000      -81.984   -61.09915
------------------------------------------------------------------------------

. outreg2 using OLS, excel dec(3) 
OLS.xml
dir : seeout

. 
. tsset instant, generic
        time variable:  instant, 1 to 17379
                delta:  1 unit

. **test autocorr
. reg cnt i.season i.holiday i.workingday i.weather temp hum windspeed i.rush 

      Source |       SS           df       MS      Number of obs   =    17,379
-------------+----------------------------------   F(12, 17366)    =   1272.56
       Model |   267526689        12  22293890.7   Prob > F        =    0.0000
    Residual |   304234902    17,366   17518.997   R-squared       =    0.4679
-------------+----------------------------------   Adj R-squared   =    0.4675
       Total |   571761591    17,378  32901.4611   Root MSE        =    132.36

------------------------------------------------------------------------------
         cnt |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      season |
          2  |    5.65475   3.585441     1.58   0.115    -1.373075    12.68257
          3  |   -33.0058   4.583393    -7.20   0.000    -41.98971   -24.02189
          4  |   57.60806   3.148695    18.30   0.000      51.4363    63.77982
             |
   1.holiday |  -27.28844   6.214356    -4.39   0.000     -39.4692   -15.10768
1.workingday |   2.146411   2.235913     0.96   0.337    -2.236203    6.529025
             |
  weathersit |
          2  |    14.2258   2.449605     5.81   0.000     9.424324    19.02727
          3  |  -16.37264   4.090734    -4.00   0.000    -24.39089   -8.354386
          4  |   39.75719   76.48754     0.52   0.603    -110.1661    189.6805
             |
        temp |   421.9553    8.59585    49.09   0.000     405.1066     438.804
         hum |  -252.2484    6.23832   -40.44   0.000    -264.4761   -240.0206
   windspeed |   7.057296   8.797484     0.80   0.422    -10.18666    24.30125
      1.rush |   236.6076    3.04912    77.60   0.000      230.631    242.5842
       _cons |   96.89071   5.854232    16.55   0.000     85.41583    108.3656
------------------------------------------------------------------------------

. predict u, r

. scatter u instant

. graph save "/Users/shuhuisun/Downloads/Bike-Sharing-Dataset",replace
(file /Users/shuhuisun/Downloads/Bike-Sharing-Dataset.gph saved)

. graph export "/Users/shuhuisun/Downloads/Bike-Sharing-Dataset/visual_autocorrelation.tif", 
> as(tif) replace
(file /Users/shuhuisun/Downloads/Bike-Sharing-Dataset/visual_autocorrelation.tif written in T
> IFF format)

. reg u l.u ll.u lll.u

      Source |       SS           df       MS      Number of obs   =    17,376
-------------+----------------------------------   F(3, 17372)     =   7550.88
       Model |   172184084         3  57394694.7   Prob > F        =    0.0000
    Residual |   132045672    17,372   7601.0633   R-squared       =    0.5660
-------------+----------------------------------   Adj R-squared   =    0.5659
       Total |   304229756    17,375  17509.6262   Root MSE        =    87.184

------------------------------------------------------------------------------
           u |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           u |
         L1. |   .8382716   .0075853   110.51   0.000     .8234036    .8531395
         L2. |  -.1066028   .0098657   -10.81   0.000    -.1259406   -.0872649
         L3. |   -.021843   .0075853    -2.88   0.004    -.0367109   -.0069751
             |
       _cons |  -.0032147   .6613971    -0.00   0.996    -1.299619     1.29319
------------------------------------------------------------------------------

. outreg2 using ar, excel dec (3) replace
ar.xml
dir : seeout

. *lag 1 is most economically significant
. 
. *Breusch-Godfrey lm test on lag residuals significance
. reg cnt i.season i.holiday i.workingday i.weather temp hum windspeed i.rush 

      Source |       SS           df       MS      Number of obs   =    17,379
-------------+----------------------------------   F(12, 17366)    =   1272.56
       Model |   267526689        12  22293890.7   Prob > F        =    0.0000
    Residual |   304234902    17,366   17518.997   R-squared       =    0.4679
-------------+----------------------------------   Adj R-squared   =    0.4675
       Total |   571761591    17,378  32901.4611   Root MSE        =    132.36

------------------------------------------------------------------------------
         cnt |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      season |
          2  |    5.65475   3.585441     1.58   0.115    -1.373075    12.68257
          3  |   -33.0058   4.583393    -7.20   0.000    -41.98971   -24.02189
          4  |   57.60806   3.148695    18.30   0.000      51.4363    63.77982
             |
   1.holiday |  -27.28844   6.214356    -4.39   0.000     -39.4692   -15.10768
1.workingday |   2.146411   2.235913     0.96   0.337    -2.236203    6.529025
             |
  weathersit |
          2  |    14.2258   2.449605     5.81   0.000     9.424324    19.02727
          3  |  -16.37264   4.090734    -4.00   0.000    -24.39089   -8.354386
          4  |   39.75719   76.48754     0.52   0.603    -110.1661    189.6805
             |
        temp |   421.9553    8.59585    49.09   0.000     405.1066     438.804
         hum |  -252.2484    6.23832   -40.44   0.000    -264.4761   -240.0206
   windspeed |   7.057296   8.797484     0.80   0.422    -10.18666    24.30125
      1.rush |   236.6076    3.04912    77.60   0.000      230.631    242.5842
       _cons |   96.89071   5.854232    16.55   0.000     85.41583    108.3656
------------------------------------------------------------------------------

. estat bgodfrey, lags(1)

Breusch-Godfrey LM test for autocorrelation
---------------------------------------------------------------------------
    lags(p)  |          chi2               df                 Prob > chi2
-------------+-------------------------------------------------------------
       1     |      10123.231               1                   0.0000
---------------------------------------------------------------------------
                        H0: no serial correlation

. *significant autocorrelation in the model.
. *durbin-watson test
. estat dwatson

Durbin-Watson d-statistic( 13, 17379) =  .5048436

. *for AR(1)
. *d=.49. far from 2, center of its distribution. Given #Xs=36, #obs=17319, the lower 5% is l
> arger than 1.855. Durbin-watson test concludes that there is positive autocorrelation.
. *estat durbinalt, lags(1)
. *Alternative D-W test just to make sure
. 
. 
. 
. *stationarity way:  differencing, take square root, taking moving average. we use ma.
. gen dcnt = cnt-l.cnt
(1 missing value generated)

. tsline dcnt in 1/100

. dfuller dcnt

Dickey-Fuller test for unit root                   Number of obs   =     17377

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)            -96.801            -3.430            -2.860            -2.570
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.0000

. gen lcnt = log(cnt)

. tsline lcnt in 1/100

. dfuller lcnt

Dickey-Fuller test for unit root                   Number of obs   =     17378

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)            -31.776            -3.430            -2.860            -2.570
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.0000

. gen sqrtcnt = cnt^.5

. tsline sqrtcnt in 1/100

. dfuller sqrtcnt

Dickey-Fuller test for unit root                   Number of obs   =     17378

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)            -31.534            -3.430            -2.860            -2.570
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.0000

. *above methods dont work well
. 
. tssmooth ma macnt = cnt, window(72)
The smoother applied was
     (1/72)*[x(t-72) + x(t-71) + x(t-70) + x(t-69) + x(t-68) + x(t-67) + x(t-66) +
     x(t-65) + x(t-64) + x(t-63) + x(t-62) + x(t-61) + x(t-60) + x(t-59) + x(t-58) +
     x(t-57) + x(t-56) + x(t-55) + x(t-54) + x(t-53) + x(t-52) + x(t-51) + x(t-50) +
     x(t-49) + x(t-48) + x(t-47) + x(t-46) + x(t-45) + x(t-44) + x(t-43) + x(t-42) +
     x(t-41) + x(t-40) + x(t-39) + x(t-38) + x(t-37) + x(t-36) + x(t-35) + x(t-34) +
     x(t-33) + x(t-32) + x(t-31) + x(t-30) + x(t-29) + x(t-28) + x(t-27) + x(t-26) +
     x(t-25) + x(t-24) + x(t-23) + x(t-22) + x(t-21) + x(t-20) + x(t-19) + x(t-18) +
     x(t-17) + x(t-16) + x(t-15) + x(t-14) + x(t-13) + x(t-12) + x(t-11) + x(t-10) +
     x(t-9) + x(t-8) + x(t-7) + x(t-6) + x(t-5) + x(t-4) + x(t-3) + x(t-2) + x(t-1) +
     ...; x(t)= cnt

. dfuller macnt

Dickey-Fuller test for unit root                   Number of obs   =     17377

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)             -2.336            -3.430            -2.860            -2.570
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.1606

. tssmooth ma matemp = temp, window(72)
The smoother applied was
     (1/72)*[x(t-72) + x(t-71) + x(t-70) + x(t-69) + x(t-68) + x(t-67) + x(t-66) +
     x(t-65) + x(t-64) + x(t-63) + x(t-62) + x(t-61) + x(t-60) + x(t-59) + x(t-58) +
     x(t-57) + x(t-56) + x(t-55) + x(t-54) + x(t-53) + x(t-52) + x(t-51) + x(t-50) +
     x(t-49) + x(t-48) + x(t-47) + x(t-46) + x(t-45) + x(t-44) + x(t-43) + x(t-42) +
     x(t-41) + x(t-40) + x(t-39) + x(t-38) + x(t-37) + x(t-36) + x(t-35) + x(t-34) +
     x(t-33) + x(t-32) + x(t-31) + x(t-30) + x(t-29) + x(t-28) + x(t-27) + x(t-26) +
     x(t-25) + x(t-24) + x(t-23) + x(t-22) + x(t-21) + x(t-20) + x(t-19) + x(t-18) +
     x(t-17) + x(t-16) + x(t-15) + x(t-14) + x(t-13) + x(t-12) + x(t-11) + x(t-10) +
     x(t-9) + x(t-8) + x(t-7) + x(t-6) + x(t-5) + x(t-4) + x(t-3) + x(t-2) + x(t-1) +
     ...; x(t)= temp

. dfuller matemp 

Dickey-Fuller test for unit root                   Number of obs   =     17377

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)             -0.585            -3.430            -2.860            -2.570
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.8744

. tssmooth ma mahum = hum, window(72)
The smoother applied was
     (1/72)*[x(t-72) + x(t-71) + x(t-70) + x(t-69) + x(t-68) + x(t-67) + x(t-66) +
     x(t-65) + x(t-64) + x(t-63) + x(t-62) + x(t-61) + x(t-60) + x(t-59) + x(t-58) +
     x(t-57) + x(t-56) + x(t-55) + x(t-54) + x(t-53) + x(t-52) + x(t-51) + x(t-50) +
     x(t-49) + x(t-48) + x(t-47) + x(t-46) + x(t-45) + x(t-44) + x(t-43) + x(t-42) +
     x(t-41) + x(t-40) + x(t-39) + x(t-38) + x(t-37) + x(t-36) + x(t-35) + x(t-34) +
     x(t-33) + x(t-32) + x(t-31) + x(t-30) + x(t-29) + x(t-28) + x(t-27) + x(t-26) +
     x(t-25) + x(t-24) + x(t-23) + x(t-22) + x(t-21) + x(t-20) + x(t-19) + x(t-18) +
     x(t-17) + x(t-16) + x(t-15) + x(t-14) + x(t-13) + x(t-12) + x(t-11) + x(t-10) +
     x(t-9) + x(t-8) + x(t-7) + x(t-6) + x(t-5) + x(t-4) + x(t-3) + x(t-2) + x(t-1) +
     ...; x(t)= hum

. dfuller mahum 

Dickey-Fuller test for unit root                   Number of obs   =     17377

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)             -2.239            -3.430            -2.860            -2.570
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.1925

. tssmooth ma mawindspeed = windspeed, window(72)
The smoother applied was
     (1/72)*[x(t-72) + x(t-71) + x(t-70) + x(t-69) + x(t-68) + x(t-67) + x(t-66) +
     x(t-65) + x(t-64) + x(t-63) + x(t-62) + x(t-61) + x(t-60) + x(t-59) + x(t-58) +
     x(t-57) + x(t-56) + x(t-55) + x(t-54) + x(t-53) + x(t-52) + x(t-51) + x(t-50) +
     x(t-49) + x(t-48) + x(t-47) + x(t-46) + x(t-45) + x(t-44) + x(t-43) + x(t-42) +
     x(t-41) + x(t-40) + x(t-39) + x(t-38) + x(t-37) + x(t-36) + x(t-35) + x(t-34) +
     x(t-33) + x(t-32) + x(t-31) + x(t-30) + x(t-29) + x(t-28) + x(t-27) + x(t-26) +
     x(t-25) + x(t-24) + x(t-23) + x(t-22) + x(t-21) + x(t-20) + x(t-19) + x(t-18) +
     x(t-17) + x(t-16) + x(t-15) + x(t-14) + x(t-13) + x(t-12) + x(t-11) + x(t-10) +
     x(t-9) + x(t-8) + x(t-7) + x(t-6) + x(t-5) + x(t-4) + x(t-3) + x(t-2) + x(t-1) +
     ...; x(t)= windspeed

. dfuller mawindspeed

Dickey-Fuller test for unit root                   Number of obs   =     17377

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)             -3.916            -3.430            -2.860            -2.570
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.0019

. *after taking ma of 72 lags which is 72 hours, all continuous variables are statoinary
. 
. 
. xi: arima macnt i.season i.holiday i.workingday i.weather matemp mahum mawindspeed i.rush, 
> arima(1,0,0) robust
i.season          _Iseason_1-4        (naturally coded; _Iseason_1 omitted)
i.holiday         _Iholiday_0-1       (naturally coded; _Iholiday_0 omitted)
i.workingday      _Iworkingda_0-1     (naturally coded; _Iworkingda_0 omitted)
i.weathersit      _Iweathersi_1-4     (naturally coded; _Iweathersi_1 omitted)
i.rush            _Irush_0-1          (naturally coded; _Irush_0 omitted)

(setting optimization to BHHH)
Iteration 0:   log pseudolikelihood = -49568.813  
Iteration 1:   log pseudolikelihood = -41257.832  
Iteration 2:   log pseudolikelihood = -39199.838  
Iteration 3:   log pseudolikelihood = -38707.426  
Iteration 4:   log pseudolikelihood = -38585.287  
(switching optimization to BFGS)
BFGS stepping has contracted, resetting BFGS Hessian (0)
Iteration 5:   log pseudolikelihood = -38502.914  
Iteration 6:   log pseudolikelihood = -38496.514  (backed up)
Iteration 7:   log pseudolikelihood = -38486.565  (backed up)
Iteration 8:   log pseudolikelihood = -38428.686  
Iteration 9:   log pseudolikelihood = -38389.953  (backed up)
Iteration 10:  log pseudolikelihood = -38346.995  
Iteration 11:  log pseudolikelihood = -38342.497  (backed up)
Iteration 12:  log pseudolikelihood =  -38226.13  
Iteration 13:  log pseudolikelihood = -37855.694  
Iteration 14:  log pseudolikelihood =  -37614.49  
(switching optimization to BHHH)
Iteration 15:  log pseudolikelihood = -37588.577  
Iteration 16:  log pseudolikelihood = -37585.634  
Iteration 17:  log pseudolikelihood =  -37583.54  
Iteration 18:  log pseudolikelihood = -37582.969  
Iteration 19:  log pseudolikelihood = -37581.147  
(switching optimization to BFGS)
Iteration 20:  log pseudolikelihood = -37572.903  
Iteration 21:  log pseudolikelihood = -37570.077  
BFGS stepping has contracted, resetting BFGS Hessian (1)
Iteration 22:  log pseudolikelihood = -37565.509  
Iteration 23:  log pseudolikelihood = -37565.303  (backed up)
Iteration 24:  log pseudolikelihood = -37565.288  (backed up)
Iteration 25:  log pseudolikelihood = -37565.231  (backed up)
Iteration 26:  log pseudolikelihood = -37565.055  
Iteration 27:  log pseudolikelihood =  -37564.61  
Iteration 28:  log pseudolikelihood = -37564.579  (backed up)
Iteration 29:  log pseudolikelihood =  -37564.24  (backed up)
(switching optimization to BHHH)
Iteration 30:  log pseudolikelihood = -37563.379  
Iteration 31:  log pseudolikelihood = -37562.597  
Iteration 32:  log pseudolikelihood = -37561.555  
Iteration 33:  log pseudolikelihood = -37561.389  
Iteration 34:  log pseudolikelihood = -37560.826  
(switching optimization to BFGS)
Iteration 35:  log pseudolikelihood = -37560.565  
Iteration 36:  log pseudolikelihood = -37560.112  
Iteration 37:  log pseudolikelihood = -37559.942  
Iteration 38:  log pseudolikelihood = -37559.421  
Iteration 39:  log pseudolikelihood = -37559.292  
Iteration 40:  log pseudolikelihood = -37559.098  
Iteration 41:  log pseudolikelihood = -37559.055  
Iteration 42:  log pseudolikelihood = -37559.011  
Iteration 43:  log pseudolikelihood = -37559.011  
Iteration 44:  log pseudolikelihood = -37559.011  
(switching optimization to BHHH)
Iteration 45:  log pseudolikelihood = -37559.011  
Iteration 46:  log pseudolikelihood = -37559.011  
Iteration 47:  log pseudolikelihood = -37559.011  
Iteration 48:  log pseudolikelihood = -37559.011  
Iteration 49:  log pseudolikelihood = -37559.011  
(switching optimization to BFGS)
Iteration 50:  log pseudolikelihood = -37559.011  
Iteration 51:  log pseudolikelihood = -37559.011  

ARIMA regression

Sample:  2 - 17379                              Number of obs     =      17378
                                                Wald chi2(13)     =   1.14e+07
Log pseudolikelihood = -37559.01                Prob > chi2       =     0.0000

-------------------------------------------------------------------------------
              |             Semirobust
        macnt |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
macnt         |
   _Iseason_2 |  -.1745888   .4835108    -0.36   0.718    -1.122253     .773075
   _Iseason_3 |  -.6843362   .5106696    -1.34   0.180     -1.68523    .3165577
   _Iseason_4 |   .2439321   .3906566     0.62   0.532    -.5217407    1.009605
  _Iholiday_1 |  -.0064912   .1090351    -0.06   0.953    -.2201961    .2072137
_Iworkingda_1 |  -.4616649   .0507671    -9.09   0.000    -.5611666   -.3621631
_Iweathersi_2 |   .1303249   .0488345     2.67   0.008      .034611    .2260387
_Iweathersi_3 |   .2689532   .0789976     3.40   0.001     .1141207    .4237856
_Iweathersi_4 |   .0344129   .6237054     0.06   0.956    -1.188027    1.256853
       matemp |   227.6278    11.1014    20.50   0.000     205.8695    249.3862
        mahum |  -128.6158    5.23388   -24.57   0.000     -138.874   -118.3576
  mawindspeed |  -47.15185   6.914481    -6.82   0.000    -60.70398   -33.59971
     _Irush_1 |  -.0203628   .0621326    -0.33   0.743    -.1421404    .1014148
        _cons |   154.6801   25.53469     6.06   0.000     104.6331    204.7272
--------------+----------------------------------------------------------------
ARMA          |
           ar |
          L1. |   .9993598   .0002999  3331.78   0.000      .998772    .9999477
--------------+----------------------------------------------------------------
       /sigma |   2.100481   .0177194   118.54   0.000     2.065752     2.13521
-------------------------------------------------------------------------------
Note: The test of the variance against zero is one sided, and the two-sided
      confidence interval is truncated at zero.

. outreg2 using arima, excel dec(3) replace
arima.xml
dir : seeout

. 
. *test structural break? -- chow's
. 
. *reg cnt i.season i.holiday i.workingday i.weather temp hum windspeed i.hr
. *estat archlm
. *not valid
. *lm test concludes that there exists autoregressive conditional heteroskedasticity (ARCH)
. 
. *prais cnt i.season i.holiday i.workingday i.weather temp hum windspeed i.hr, rhotype(regre
> ss)
. *FGLS gets rho value at around .8017 by interation
. 
. *GARCH specification might be helpful in predicting demand and the volatility of demand
. *coefficient is significant, implying that the variance of the bike sharing demand is condi
> tional on the variance of the previous period. 
. xi: arch macnt i.season i.holiday i.workingday i.weather matemp mahum mawindspeed i.rush, a
> rch(1)
i.season          _Iseason_1-4        (naturally coded; _Iseason_1 omitted)
i.holiday         _Iholiday_0-1       (naturally coded; _Iholiday_0 omitted)
i.workingday      _Iworkingda_0-1     (naturally coded; _Iworkingda_0 omitted)
i.weathersit      _Iweathersi_1-4     (naturally coded; _Iweathersi_1 omitted)
i.rush            _Irush_0-1          (naturally coded; _Irush_0 omitted)

(setting optimization to BHHH)
Iteration 0:   log likelihood = -86862.337  
Iteration 1:   log likelihood = -86846.859  
Iteration 2:   log likelihood = -86777.588  
Iteration 3:   log likelihood = -86544.839  
Iteration 4:   log likelihood = -86534.336  
(switching optimization to BFGS)
Iteration 5:   log likelihood = -86505.637  
Iteration 6:   log likelihood = -85647.594  
Iteration 7:   log likelihood = -85289.315  
Iteration 8:   log likelihood = -85124.084  
Iteration 9:   log likelihood = -84322.393  
Iteration 10:  log likelihood = -83580.918  
Iteration 11:  log likelihood = -83435.265  
Iteration 12:  log likelihood = -83198.257  
Iteration 13:  log likelihood = -83079.774  
Iteration 14:  log likelihood = -83005.506  
(switching optimization to BHHH)
Iteration 15:  log likelihood = -82881.219  
Iteration 16:  log likelihood = -82856.961  
Iteration 17:  log likelihood = -82829.729  
Iteration 18:  log likelihood = -82822.555  
Iteration 19:  log likelihood = -82821.663  
(switching optimization to BFGS)
Iteration 20:  log likelihood = -82817.512  
Iteration 21:  log likelihood = -82767.105  
Iteration 22:  log likelihood = -82677.467  
Iteration 23:  log likelihood = -82640.077  
Iteration 24:  log likelihood = -82603.381  
Iteration 25:  log likelihood =  -82583.73  
Iteration 26:  log likelihood = -82533.803  
Iteration 27:  log likelihood = -82512.045  
Iteration 28:  log likelihood = -82502.187  
Iteration 29:  log likelihood =  -82492.58  
(switching optimization to BHHH)
Iteration 30:  log likelihood = -82457.701  
Iteration 31:  log likelihood = -82454.555  
Iteration 32:  log likelihood = -82452.745  
Iteration 33:  log likelihood =  -82445.59  
Iteration 34:  log likelihood = -82444.865  
(switching optimization to BFGS)
Iteration 35:  log likelihood = -82436.878  
Iteration 36:  log likelihood = -82414.316  
Iteration 37:  log likelihood = -82408.343  
Iteration 38:  log likelihood =  -82405.04  
Iteration 39:  log likelihood =   -82358.6  
Iteration 40:  log likelihood = -82357.893  
Iteration 41:  log likelihood =  -82307.44  
Iteration 42:  log likelihood = -82296.594  
Iteration 43:  log likelihood = -82294.278  
Iteration 44:  log likelihood = -82293.573  
(switching optimization to BHHH)
Iteration 45:  log likelihood = -82293.485  
Iteration 46:  log likelihood =  -82293.48  
Iteration 47:  log likelihood = -82293.479  
Iteration 48:  log likelihood = -82293.478  
Iteration 49:  log likelihood = -82293.478  
(switching optimization to BFGS)
Iteration 50:  log likelihood =  -82293.47  
Iteration 51:  log likelihood = -82293.457  
Iteration 52:  log likelihood = -82293.454  
Iteration 53:  log likelihood = -82293.453  
Iteration 54:  log likelihood = -82293.452  
Iteration 55:  log likelihood = -82293.451  
Iteration 56:  log likelihood = -82293.451  
Iteration 57:  log likelihood = -82293.451  
Iteration 58:  log likelihood = -82293.451  
Iteration 59:  log likelihood = -82293.451  
(switching optimization to BHHH)
Iteration 60:  log likelihood = -82293.451  
Iteration 61:  log likelihood = -82293.451  

ARCH family regression

Sample: 2 - 17379                                 Number of obs   =     17,378
Distribution: Gaussian                            Wald chi2(12)   =   1.24e+06
Log likelihood = -82293.45                        Prob > chi2     =     0.0000

-------------------------------------------------------------------------------
              |                 OPG
        macnt |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
macnt         |
   _Iseason_2 |   41.39961   .2436082   169.94   0.000     40.92214    41.87707
   _Iseason_3 |   .5723332   .3271116     1.75   0.080    -.0687937     1.21346
   _Iseason_4 |   45.13269   .1725379   261.58   0.000     44.79453    45.47086
  _Iholiday_1 |  -2.093603   .2980304    -7.02   0.000    -2.677732   -1.509474
_Iworkingda_1 |   -2.31727   .1015393   -22.82   0.000    -2.516283   -2.118257
_Iweathersi_2 |  -.5314943   .1041401    -5.10   0.000    -.7356052   -.3273834
_Iweathersi_3 |  -.4895775   .1375506    -3.56   0.000    -.7591717   -.2199833
_Iweathersi_4 |   14.35771   3.967323     3.62   0.000     6.581904    22.13352
       matemp |   290.9732   .6603147   440.66   0.000      289.679    292.2674
        mahum |  -166.8675   .5840231  -285.72   0.000    -168.0122   -165.7229
  mawindspeed |  -237.3942   .9174175  -258.76   0.000    -239.1923   -235.5961
     _Irush_1 |  -.1285878   .0774136    -1.66   0.097    -.2803156      .02314
        _cons |   151.8088   .4463002   340.15   0.000     150.9341    152.6835
--------------+----------------------------------------------------------------
ARCH          |
         arch |
          L1. |   1.006793   .0472035    21.33   0.000     .9142759     1.09931
              |
        _cons |   2.175947    .108679    20.02   0.000      1.96294    2.388954
-------------------------------------------------------------------------------

. outreg2 using arima, excel dec(3) 
arima.xml
dir : seeout

. 
. 
. 
. 
. log close 
      name:  <unnamed>
       log:  /Users/shuhuisun/Downloads/bike-sharing-demand/final project4.log
  log type:  text
 closed on:   9 Dec 2022, 09:57:04
---------------------------------------------------------------------------------------------
